tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "rbenv/tap"
tap "warrensbox/tap"
brew "ack"
brew "adns"
brew "lz4"
brew "python@3.12"
brew "glib"
brew "lzo"
brew "cairo"
brew "graphite2"
brew "icu4c"
brew "harfbuzz"
brew "apache-spark"
brew "autoconf"
brew "python@3.10"
brew "autojump"
brew "automake"
brew "autossh"
brew "awscli"
brew "bash"
brew "bat"
brew "bfg"
brew "chruby"
brew "cocoapods"
brew "gmp"
brew "coreutils"
brew "cscope"
brew "curl"
brew "difftastic"
brew "docker-credential-helper-ecr"
brew "dotnet"
brew "fd"
brew "fribidi"
brew "libunistring"
brew "libidn2"
brew "gnutls"
brew "pango"
brew "ffmpeg"
brew "fish"
brew "libtool"
brew "fzf"
is_fzf_installed = !`which fzf`.chomp.empty?
if is_fish_installed && is_fzf_installed 
  File.open("#{Dir.home}/.config/fish/conf.d/fzf-activate.fish", mode:'w') do |f|
    f.write("status is-interactive; or exit 0\n\n")
    f.write(`fzf --fish`)
    f.write("\n\nbind --erase \cr")
  end
end
brew "gcc"
brew "gd"
brew "gdk-pixbuf"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "git-secrets"
brew "git-sizer"
brew "gnu-getopt"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "gradle"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "groovy"
brew "htop"
brew "hub"
brew "hugo"
brew "jnv"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "leiningen"
brew "python@3.9"
brew "libcroco"
brew "libpq", link: true
brew "libusb-compat"
brew "libxml2"
brew "luajit"
brew "mas"
brew "maven"
brew "mise"
is_mise_installed = !`which mise`.chomp.empty?
if is_fish_installed && is_mise_installed 
  File.open("#{Dir.home}/.config/fish/conf.d/mise-activate.fish", mode:'w') do |f|
    f.write("status is-interactive; or exit 0\n\n")
    f.write(`mise activate fish`)
  end
end
brew "mysql"
brew "openjdk@11"
brew "openjdk@8"
brew "openldap"
brew "p7zip"
brew "pandoc"
brew "perl"
brew "php"
brew "pinentry-mac"
brew "pipx"
brew "pth"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.11"
brew "rclone"
brew "rust"
brew "s3cmd"
brew "sbt"
brew "scala"
brew "shared-mime-info"
brew "socat"
brew "spatialindex"
brew "sshuttle"
brew "subversion"
brew "telnet"
brew "terminal-notifier"
brew "tfenv"
brew "tflint"
brew "thefuck"
brew "tldr"
brew "travis"
brew "tree"
brew "uv"
brew "viddy"
brew "vim"
brew "wget"
brew "xhyve"
brew "yarn"
brew "yt-dlp"
brew "rbenv/tap/openssl@1.0"
brew "warrensbox/tap/tfswitch"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "android-file-transfer"
cask "arc"
cask "audacity"
cask "aws-vault"
cask "caffeine"
cask "daisydisk"
cask "discord"
cask "docker"
cask "dozer"
cask "firefox"
cask "flutter"
cask "flux"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-open-sans"
cask "font-powerline-symbols"
cask "font-source-code-pro"
cask "google-chrome"
cask "istat-menus"
cask "iterm2"
cask "jetbrains-toolbox"
cask "kindle"
cask "librewolf"
cask "obsidian"
cask "omnigraffle"
cask "openvpn-connect"
cask "pop"
cask "postman"
cask "rectangle"
cask "robo-3t"
cask "shortcutdetective"
cask "signal"
cask "slack"
cask "spectacle"
cask "tableplus"
cask "textual"
cask "toggl-track"
cask "vagrant"
cask "visual-studio-code"
cask "vlc"
cask "webex"
cask "whatsapp"
cask "zoom"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Meeter", id: 1510445899
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
vscode "editorconfig.editorconfig"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "haskell.haskell"
vscode "justusadam.language-haskell"
vscode "k--kato.intellij-idea-keybindings"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.java"
vscode "skyapps.fish-vscode"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-maven"
